sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
  [..]
    The HAL_USART_Init() function follows the USART  synchronous configuration
    procedures (details for the procedures are available in reference manuals).

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the USART mode according to the specified
  *         parameters in the USART_InitTypeDef and initialize the associated handle.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_Init(USART_HandleTypeDef *husart)
{
    /* Check the USART handle allocation */
    if (husart == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_USART_INSTANCE(husart->Instance));

    if (husart->State == HAL_USART_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        husart->Lock = HAL_UNLOCKED;

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        USART_InitCallbacksToDefault(husart);

        if (husart->MspInitCallback == NULL)
        {
            husart->MspInitCallback = HAL_USART_MspInit;
        }

        /* Init the low level hardware */
        husart->MspInitCallback(husart);
#else
        /* Init the low level hardware : GPIO, CLOCK */
        HAL_USART_MspInit(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }

    husart->State = HAL_USART_STATE_BUSY;

    /* Set the USART Communication parameters */
    USART_SetConfig(husart);

    /* In USART mode, the following bits must be kept cleared:
       - LINEN bit in the USART_CR2 register
       - HDSEL, SCEN and IREN bits in the USART_CR3 register */
//  CLEAR_BIT(husart->Instance->CR2, USART_CR2_LINEN);
//  CLEAR_BIT(husart->Instance->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN));

    /* Enable the Peripheral */
    __HAL_USART_ENABLE(husart);

    /* Initialize the USART state */
    husart->ErrorCode = HAL_USART_ERROR_NONE;
    husart->State = HAL_USART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  DeInitializes the USART peripheral.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_DeInit(USART_HandleTypeDef *husart)
{
    /* Check the USART handle allocation */
    if (husart == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_USART_INSTANCE(husart->Instance));

    husart->State = HAL_USART_STATE_BUSY;

    /* Disable the Peripheral */
    __HAL_USART_DISABLE(husart);

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    if (husart->MspDeInitCallback == NULL)
    {
        husart->MspDeInitCallback = HAL_USART_MspDeInit;
    }
    /* DeInit the low level hardware */
    husart->MspDeInitCallback(husart);
#else
    /* DeInit the low level hardware */
    HAL_USART_MspDeInit(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

    husart->ErrorCode = HAL_USART_ERROR_NONE;
    husart->State = HAL_USART_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(husart);

    return HAL_OK;
}

/**
  * @brief  USART MSP Init.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
__weak void HAL_USART_MspInit(USART_HandleTypeDef *husart)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(husart);
    /* NOTE: This function should not be modified, when the callback is needed,
             the HAL_USART_MspInit could be implemented in the user file
     */
}

/**
  * @brief  USART MSP DeInit.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
__weak void HAL_USART_MspDeInit(USART_HandleTypeDef *husart)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(husart);
    /* NOTE: This function should not be modified, when the callback is needed,
             the HAL_USART_MspDeInit could be implemented in the user file
     */
}

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User USART Callback
  *         To be used instead of the weak predefined callback
  * @param  husart usart handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_USART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref HAL_USART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_USART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref HAL_USART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_USART_TX_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_USART_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_USART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_USART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_USART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
+  */
HAL_StatusTypeDef HAL_USART_RegisterCallback(USART_HandleTypeDef *husart, HAL_USART_CallbackIDTypeDef CallbackID, pUSART_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

        return HAL_ERROR;
    }
    /* Process locked */
    __HAL_LOCK(husart);

    if (husart->State == HAL_USART_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_USART_TX_HALFCOMPLETE_CB_ID :
            husart->TxHalfCpltCallback = pCallback;
            break;

        case HAL_USART_TX_COMPLETE_CB_ID :
            husart->TxCpltCallback = pCallback;
            break;

        case HAL_USART_RX_HALFCOMPLETE_CB_ID :
            husart->RxHalfCpltCallback = pCallback;
            break;

        case HAL_USART_RX_COMPLETE_CB_ID :
            husart->RxCpltCallback = pCallback;
            break;

        case HAL_USART_TX_RX_COMPLETE_CB_ID :
            husart->TxRxCpltCallback = pCallback;
            break;

