sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
        case HAL_USART_ERROR_CB_ID :
            husart->ErrorCallback = pCallback;
            break;

        case HAL_USART_ABORT_COMPLETE_CB_ID :
            husart->AbortCpltCallback = pCallback;
            break;

        case HAL_USART_MSPINIT_CB_ID :
            husart->MspInitCallback = pCallback;
            break;

        case HAL_USART_MSPDEINIT_CB_ID :
            husart->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (husart->State == HAL_USART_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_USART_MSPINIT_CB_ID :
            husart->MspInitCallback = pCallback;
            break;

        case HAL_USART_MSPDEINIT_CB_ID :
            husart->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(husart);

    return status;
}

/**
  * @brief  Unregister an UART Callback
  *         UART callaback is redirected to the weak predefined callback
  * @param  husart uart handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_USART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref HAL_USART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_USART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref HAL_USART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_USART_TX_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_USART_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_USART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_USART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_USART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_UnRegisterCallback(USART_HandleTypeDef *husart, HAL_USART_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(husart);

    if (husart->State == HAL_USART_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_USART_TX_HALFCOMPLETE_CB_ID :
            husart->TxHalfCpltCallback = HAL_USART_TxHalfCpltCallback;               /* Legacy weak  TxHalfCpltCallback       */
            break;

        case HAL_USART_TX_COMPLETE_CB_ID :
            husart->TxCpltCallback = HAL_USART_TxCpltCallback;                       /* Legacy weak TxCpltCallback            */
            break;

        case HAL_USART_RX_HALFCOMPLETE_CB_ID :
            husart->RxHalfCpltCallback = HAL_USART_RxHalfCpltCallback;               /* Legacy weak RxHalfCpltCallback        */
            break;

        case HAL_USART_RX_COMPLETE_CB_ID :
            husart->RxCpltCallback = HAL_USART_RxCpltCallback;                       /* Legacy weak RxCpltCallback            */
            break;

        case HAL_USART_TX_RX_COMPLETE_CB_ID :
            husart->TxRxCpltCallback = HAL_USART_TxRxCpltCallback;                   /* Legacy weak TxRxCpltCallback            */
            break;

        case HAL_USART_ERROR_CB_ID :
            husart->ErrorCallback = HAL_USART_ErrorCallback;                         /* Legacy weak ErrorCallback             */
            break;

        case HAL_USART_ABORT_COMPLETE_CB_ID :
            husart->AbortCpltCallback = HAL_USART_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback         */
            break;

        case HAL_USART_MSPINIT_CB_ID :
            husart->MspInitCallback = HAL_USART_MspInit;                             /* Legacy weak MspInitCallback           */
            break;

        case HAL_USART_MSPDEINIT_CB_ID :
            husart->MspDeInitCallback = HAL_USART_MspDeInit;                         /* Legacy weak MspDeInitCallback         */
            break;

        default :
            /* Update the error code */
            husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (husart->State == HAL_USART_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_USART_MSPINIT_CB_ID :
            husart->MspInitCallback = HAL_USART_MspInit;
            break;

        case HAL_USART_MSPDEINIT_CB_ID :
            husart->MspDeInitCallback = HAL_USART_MspDeInit;
            break;

        default :
            /* Update the error code */
            husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        husart->ErrorCode |= HAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(husart);

    return status;
}
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group2 IO operation functions
  *  @brief   USART Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                         ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the USART synchronous
    data transfers.

