sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        husart->RxXferSize = Size;
        husart->RxXferCount = Size;
        /* Check the remain data to be received */
        while (husart->RxXferCount > 0U)
        {
            husart->RxXferCount--;
            if (husart->Init.WordLength == USART_WORDLENGTH_9B)
            {
                /* Wait until TXE flag is set to send dummy byte in order to generate the clock for the slave to send data */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                /* Send dummy byte in order to generate clock */
                husart->Instance->DR = (DUMMY_DATA & (uint16_t)0x01FF);

                /* Wait for RXNE Flag */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                tmp = (uint16_t *) pRxData ;
                if (husart->Init.Parity == USART_PARITY_NONE)
                {
                    *tmp = (uint16_t)(husart->Instance->DR & (uint16_t)0x01FF);
                    pRxData += 2U;
                }
                else
                {
                    *tmp = (uint16_t)(husart->Instance->DR & (uint16_t)0x00FF);
                    pRxData += 1U;
                }
            }
            else
            {
                /* Wait until TXE flag is set to send dummy byte in order to generate the clock for the slave to send data */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }

                /* Send Dummy Byte in order to generate clock */
                husart->Instance->DR = (DUMMY_DATA & (uint16_t)0x00FF);

                /* Wait until RXNE flag is set to receive the byte */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                if (husart->Init.Parity == USART_PARITY_NONE)
                {
                    /* Receive data */
                    *pRxData++ = (uint8_t)(husart->Instance->DR & (uint8_t)0x00FF);
                }
                else
                {
                    /* Receive data */
                    *pRxData++ = (uint8_t)(husart->Instance->DR & (uint8_t)0x007F);
                }

            }
        }

        husart->State = HAL_USART_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Full-Duplex Send and Receive an amount of data in full-duplex mode (blocking mode).
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data and the received data are handled as sets of u16. In this case, Size must indicate the number
  *         of u16 available through pTxData and through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to TX data buffer (u8 or u16 data elements).
  * @param  pRxData Pointer to RX data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be sent (same amount to be received).
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_TransmitReceive(USART_HandleTypeDef *husart, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size, uint32_t Timeout)
{
    uint16_t *tmp;
    uint32_t tickstart = 0U;

    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0))
        {
            return  HAL_ERROR;
        }
        /* Process Locked */
        __HAL_LOCK(husart);

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_RX;

        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        husart->RxXferSize = Size;
        husart->TxXferSize = Size;
        husart->TxXferCount = Size;
        husart->RxXferCount = Size;

        /* Check the remain data to be received */
        while (husart->TxXferCount > 0U)
        {
            husart->TxXferCount--;
            husart->RxXferCount--;
            if (husart->Init.WordLength == USART_WORDLENGTH_9B)
            {
                /* Wait for TC flag in order to write data in DR */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                tmp = (uint16_t *) pTxData;
                husart->Instance->DR = (*tmp & (uint16_t)0x01FF);
                if (husart->Init.Parity == USART_PARITY_NONE)
                {
                    pTxData += 2U;
                }
                else
                {
                    pTxData += 1U;
                }

                /* Wait for RXNE Flag */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                tmp = (uint16_t *) pRxData ;
                if (husart->Init.Parity == USART_PARITY_NONE)
                {
                    *tmp = (uint16_t)(husart->Instance->DR & (uint16_t)0x01FF);
                    pRxData += 2U;
                }
                else
                {
                    *tmp = (uint16_t)(husart->Instance->DR & (uint16_t)0x00FF);
                    pRxData += 1U;
                }
            }
            else
            {
                /* Wait for TC flag in order to write data in DR */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                husart->Instance->DR = (*pTxData++ & (uint8_t)0x00FF);

                /* Wait for RXNE Flag */
                if (USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                if (husart->Init.Parity == USART_PARITY_NONE)
                {
                    /* Receive data */
                    *pRxData++ = (uint8_t)(husart->Instance->DR & (uint8_t)0x00FF);
                }
                else
                {
                    /* Receive data */
                    *pRxData++ = (uint8_t)(husart->Instance->DR & (uint8_t)0x007F);
                }
            }
        }

        husart->State = HAL_USART_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Simplex Send an amount of data in non-blocking mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pTxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be sent.
  * @retval HAL status
  * @note   The USART errors are not managed to avoid the overrun error.
  */
HAL_StatusTypeDef HAL_USART_Transmit_IT(USART_HandleTypeDef *husart, uint8_t *pTxData, uint16_t Size)
{
    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pTxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pTxBuffPtr = pTxData;
        husart->TxXferSize = Size;
        husart->TxXferCount = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_TX;

        /* The USART Error Interrupts: (Frame error, Noise error, Overrun error)
           are not managed by the USART transmit process to avoid the overrun interrupt
           when the USART mode is configured for transmit and receive "USART_MODE_TX_RX"
           to benefit for the frame error and noise interrupts the USART mode should be
           configured only for transmit "USART_MODE_TX"
           The __HAL_USART_ENABLE_IT(husart, USART_IT_ERR) can be used to enable the Frame error,
           Noise error interrupt */

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        /* Enable the USART Transmit Data Register Empty Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_TXEIE);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Simplex Receive an amount of data in non-blocking mode.
  * @note   To receive synchronous data, dummy data are simultaneously transmitted.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pRxData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_Receive_IT(USART_HandleTypeDef *husart, uint8_t *pRxData, uint16_t Size)
{
    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pRxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }
        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pRxBuffPtr = pRxData;
        husart->RxXferSize = Size;
        husart->RxXferCount = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_RX;

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

