sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
        /* Enable the USART Parity Error and Data Register not empty Interrupts */
        SET_BIT(husart->Instance->CR1, USART_CR1_PEIE | USART_CR1_RXNEIE);

        /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(husart->Instance->CR3, USART_CR3_EIE);

        /* Send dummy byte in order to generate the clock for the slave to send data */
        husart->Instance->DR = (DUMMY_DATA & (uint16_t)0x01FF);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Full-Duplex Send and Receive an amount of data in full-duplex mode (non-blocking).
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data and the received data are handled as sets of u16. In this case, Size must indicate the number
  *         of u16 available through pTxData and through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to TX data buffer (u8 or u16 data elements).
  * @param  pRxData Pointer to RX data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be sent (same amount to be received).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_TransmitReceive_IT(USART_HandleTypeDef *husart, uint8_t *pTxData, uint8_t *pRxData,  uint16_t Size)
{
    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }
        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pRxBuffPtr = pRxData;
        husart->RxXferSize = Size;
        husart->RxXferCount = Size;
        husart->pTxBuffPtr = pTxData;
        husart->TxXferSize = Size;
        husart->TxXferCount = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_TX_RX;

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        /* Enable the USART Data Register not empty Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_RXNEIE);

        /* Enable the USART Parity Error Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_PEIE);

        /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(husart->Instance->CR3, USART_CR3_EIE);

        /* Enable the USART Transmit Data Register Empty Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_TXEIE);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Simplex Send an amount of data in DMA mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pTxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be sent.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_Transmit_DMA(USART_HandleTypeDef *husart, uint8_t *pTxData, uint16_t Size)
{
    uint32_t *tmp;

    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pTxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }
        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pTxBuffPtr = pTxData;
        husart->TxXferSize = Size;
        husart->TxXferCount = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_TX;

        /* Set the USART DMA transfer complete callback */
        husart->hdmatx->XferCpltCallback = USART_DMATransmitCplt;

        /* Set the USART DMA Half transfer complete callback */
        husart->hdmatx->XferHalfCpltCallback = USART_DMATxHalfCplt;

        /* Set the DMA error callback */
        husart->hdmatx->XferErrorCallback = USART_DMAError;

        /* Set the DMA abort callback */
        husart->hdmatx->XferAbortCallback = NULL;

        /* Enable the USART transmit DMA channel */
        tmp = (uint32_t *)&pTxData;
        HAL_DMA_Start_IT(husart->hdmatx, *(uint32_t *)tmp, (uint32_t)&husart->Instance->DR, Size);

        /* Clear the TC flag in the SR register by writing 0 to it */
        __HAL_USART_CLEAR_FLAG(husart, USART_FLAG_TC);

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        /* Enable the DMA transfer for transmit request by setting the DMAT bit
        in the USART CR3 register */
        SET_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Full-Duplex Receive an amount of data in DMA mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pRxData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be received.
  * @retval HAL status
  * @note   The USART DMA transmit channel must be configured in order to generate the clock for the slave.
  * @note   When the USART parity is enabled (PCE = 1) the data received contain the parity bit.
  */
HAL_StatusTypeDef HAL_USART_Receive_DMA(USART_HandleTypeDef *husart, uint8_t *pRxData, uint16_t Size)
{
    uint32_t *tmp;

    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pRxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pRxBuffPtr = pRxData;
        husart->RxXferSize = Size;
        husart->pTxBuffPtr = pRxData;
        husart->TxXferSize = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_RX;

        /* Set the USART DMA Rx transfer complete callback */
        husart->hdmarx->XferCpltCallback = USART_DMAReceiveCplt;

        /* Set the USART DMA Half transfer complete callback */
        husart->hdmarx->XferHalfCpltCallback = USART_DMARxHalfCplt;

        /* Set the USART DMA Rx transfer error callback */
        husart->hdmarx->XferErrorCallback = USART_DMAError;

        /* Set the DMA abort callback */
        husart->hdmarx->XferAbortCallback = NULL;

        /* Set the USART Tx DMA transfer complete callback as NULL because the communication closing
        is performed in DMA reception complete callback  */
        husart->hdmatx->XferHalfCpltCallback = NULL;
        husart->hdmatx->XferCpltCallback = NULL;

        /* Set the DMA error callback */
        husart->hdmatx->XferErrorCallback = USART_DMAError;

        /* Set the DMA AbortCpltCallback */
        husart->hdmatx->XferAbortCallback = NULL;

        /* Enable the USART receive DMA channel */
        tmp = (uint32_t *)&pRxData;
        HAL_DMA_Start_IT(husart->hdmarx, (uint32_t)&husart->Instance->DR, *(uint32_t *)tmp, Size);

        /* Enable the USART transmit DMA channel: the transmit channel is used in order
           to generate in the non-blocking mode the clock to the slave device,
           this mode isn't a simplex receive mode but a full-duplex receive one */
        HAL_DMA_Start_IT(husart->hdmatx, *(uint32_t *)tmp, (uint32_t)&husart->Instance->DR, Size);

