sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
        /* Clear the Overrun flag just before enabling the DMA Rx request: mandatory for the second transfer */
        __HAL_USART_CLEAR_OREFLAG(husart);

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        /* Enable the USART Parity Error Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_PEIE);

        /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(husart->Instance->CR3, USART_CR3_EIE);

        /* Enable the DMA transfer for the receiver request by setting the DMAR bit
           in the USART CR3 register */
        SET_BIT(husart->Instance->CR3, USART_CR3_DMAR);

        /* Enable the DMA transfer for transmit request by setting the DMAT bit
           in the USART CR3 register */
        SET_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Full-Duplex Transmit Receive an amount of data in DMA mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data and the received data are handled as sets of u16. In this case, Size must indicate the number
  *         of u16 available through pTxData and through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to TX data buffer (u8 or u16 data elements).
  * @param  pRxData Pointer to RX data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be received/sent.
  * @note   When the USART parity is enabled (PCE = 1) the data received contain the parity bit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_TransmitReceive_DMA(USART_HandleTypeDef *husart, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size)
{
    uint32_t *tmp;

    if (husart->State == HAL_USART_STATE_READY)
    {
        if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0))
        {
            return HAL_ERROR;
        }
        /* Process Locked */
        __HAL_LOCK(husart);

        husart->pRxBuffPtr = pRxData;
        husart->RxXferSize = Size;
        husart->pTxBuffPtr = pTxData;
        husart->TxXferSize = Size;

        husart->ErrorCode = HAL_USART_ERROR_NONE;
        husart->State = HAL_USART_STATE_BUSY_TX_RX;

        /* Set the USART DMA Rx transfer complete callback */
        husart->hdmarx->XferCpltCallback = USART_DMAReceiveCplt;

        /* Set the USART DMA Half transfer complete callback */
        husart->hdmarx->XferHalfCpltCallback = USART_DMARxHalfCplt;

        /* Set the USART DMA Tx transfer complete callback */
        husart->hdmatx->XferCpltCallback = USART_DMATransmitCplt;

        /* Set the USART DMA Half transfer complete callback */
        husart->hdmatx->XferHalfCpltCallback = USART_DMATxHalfCplt;

        /* Set the USART DMA Tx transfer error callback */
        husart->hdmatx->XferErrorCallback = USART_DMAError;

        /* Set the USART DMA Rx transfer error callback */
        husart->hdmarx->XferErrorCallback = USART_DMAError;

        /* Set the DMA abort callback */
        husart->hdmarx->XferAbortCallback = NULL;

        /* Enable the USART receive DMA channel */
        tmp = (uint32_t *)&pRxData;
        HAL_DMA_Start_IT(husart->hdmarx, (uint32_t)&husart->Instance->DR, *(uint32_t *)tmp, Size);

        /* Enable the USART transmit DMA channel */
        tmp = (uint32_t *)&pTxData;
        HAL_DMA_Start_IT(husart->hdmatx, *(uint32_t *)tmp, (uint32_t)&husart->Instance->DR, Size);

        /* Clear the TC flag in the SR register by writing 0 to it */
        __HAL_USART_CLEAR_FLAG(husart, USART_FLAG_TC);

        /* Clear the Overrun flag: mandatory for the second transfer in circular mode */
        __HAL_USART_CLEAR_OREFLAG(husart);

        /* Process Unlocked */
        __HAL_UNLOCK(husart);

        /* Enable the USART Parity Error Interrupt */
        SET_BIT(husart->Instance->CR1, USART_CR1_PEIE);

        /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(husart->Instance->CR3, USART_CR3_EIE);

        /* Enable the DMA transfer for the receiver request by setting the DMAR bit
           in the USART CR3 register */
        SET_BIT(husart->Instance->CR3, USART_CR3_DMAR);

        /* Enable the DMA transfer for transmit request by setting the DMAT bit
           in the USART CR3 register */
        SET_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Pauses the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_DMAPause(USART_HandleTypeDef *husart)
{
    /* Process Locked */
    __HAL_LOCK(husart);

    /* Disable the USART DMA Tx request */
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

    /* Process Unlocked */
    __HAL_UNLOCK(husart);

    return HAL_OK;
}

/**
  * @brief  Resumes the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_DMAResume(USART_HandleTypeDef *husart)
{
    /* Process Locked */
    __HAL_LOCK(husart);

    /* Enable the USART DMA Tx request */
    SET_BIT(husart->Instance->CR3, USART_CR3_DMAT);

    /* Process Unlocked */
    __HAL_UNLOCK(husart);

    return HAL_OK;
}

/**
  * @brief  Stops the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USART_DMAStop(USART_HandleTypeDef *husart)
{
    uint32_t dmarequest = 0x00U;
    /* The Lock is not implemented on this API to allow the user application
       to call the HAL USART API under callbacks HAL_USART_TxCpltCallback() / HAL_USART_RxCpltCallback():
       when calling HAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
       and the correspond call back is executed HAL_USART_TxCpltCallback() / HAL_USART_RxCpltCallback()
       */

    /* Stop USART DMA Tx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAT);
    if ((husart->State == HAL_USART_STATE_BUSY_TX) && dmarequest)
    {
        USART_EndTxTransfer(husart);

