sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
        /* Abort the USART DMA Tx channel */
        if (husart->hdmatx != NULL)
        {
            HAL_DMA_Abort(husart->hdmatx);
        }

        /* Disable the USART Tx DMA request */
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);
    }

    /* Stop USART DMA Rx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR);
    if ((husart->State == HAL_USART_STATE_BUSY_RX) && dmarequest)
    {
        USART_EndRxTransfer(husart);

        /* Abort the USART DMA Rx channel */
        if (husart->hdmarx != NULL)
        {
            HAL_DMA_Abort(husart->hdmarx);
        }

        /* Disable the USART Rx DMA request */
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfer (blocking mode).
  * @param  husart USART handle.
  * @note   This procedure could be used for aborting any ongoing transfer (either Tx or Rx,
  *         as described by TransferType parameter) started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts (depending of transfer direction)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_USART_Abort(USART_HandleTypeDef *husart)
{
    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(husart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* Disable the USART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the USART DMA Tx channel : use blocking DMA Abort API (no callback) */
        if (husart->hdmatx != NULL)
        {
            /* Set the USART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            husart->hdmatx->XferAbortCallback = NULL;

            HAL_DMA_Abort(husart->hdmatx);
        }
    }

    /* Disable the USART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the USART DMA Rx channel : use blocking DMA Abort API (no callback) */
        if (husart->hdmarx != NULL)
        {
            /* Set the USART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            husart->hdmarx->XferAbortCallback = NULL;

            HAL_DMA_Abort(husart->hdmarx);
        }
    }

    /* Reset Tx and Rx transfer counters */
    husart->TxXferCount = 0x00U;
    husart->RxXferCount = 0x00U;

    /* Restore husart->State to Ready */
    husart->State  = HAL_USART_STATE_READY;

    /* Reset Handle ErrorCode to No Error */
    husart->ErrorCode = HAL_USART_ERROR_NONE;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfer (Interrupt mode).
  * @param  husart USART handle.
  * @note   This procedure could be used for aborting any ongoing transfer (either Tx or Rx,
  *         as described by TransferType parameter) started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts (depending of transfer direction)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_USART_Abort_IT(USART_HandleTypeDef *husart)
{
    uint32_t AbortCplt = 0x01U;

    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(husart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* If DMA Tx and/or DMA Rx Handles are associated to USART Handle, DMA Abort complete callbacks should be initialised
       before any call to DMA Abort functions */
    /* DMA Tx Handle is valid */
    if (husart->hdmatx != NULL)
    {
        /* Set DMA Abort Complete callback if USART DMA Tx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAT))
        {
            husart->hdmatx->XferAbortCallback = USART_DMATxAbortCallback;
        }
        else
        {
            husart->hdmatx->XferAbortCallback = NULL;
        }
    }
    /* DMA Rx Handle is valid */
    if (husart->hdmarx != NULL)
    {
        /* Set DMA Abort Complete callback if USART DMA Rx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR))
        {
            husart->hdmarx->XferAbortCallback = USART_DMARxAbortCallback;
        }
        else
        {
            husart->hdmarx->XferAbortCallback = NULL;
        }
    }

    /* Disable the USART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAT))
    {
        /* Disable DMA Tx at USART level */
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the USART DMA Tx channel : use non blocking DMA Abort API (callback) */
        if (husart->hdmatx != NULL)
        {
            /* USART Tx DMA Abort callback has already been initialised :
               will lead to call HAL_USART_AbortCpltCallback() at end of DMA abort procedure */

