sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
            /* Abort DMA TX */
            if (HAL_DMA_Abort_IT(husart->hdmatx) != HAL_OK)
            {
                husart->hdmatx->XferAbortCallback = NULL;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* Disable the USART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the USART DMA Rx channel : use non blocking DMA Abort API (callback) */
        if (husart->hdmarx != NULL)
        {
            /* USART Rx DMA Abort callback has already been initialised :
               will lead to call HAL_USART_AbortCpltCallback() at end of DMA abort procedure */

            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(husart->hdmarx) != HAL_OK)
            {
                husart->hdmarx->XferAbortCallback = NULL;
                AbortCplt = 0x01U;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
    if (AbortCplt  == 0x01U)
    {
        /* Reset Tx and Rx transfer counters */
        husart->TxXferCount = 0x00U;
        husart->RxXferCount = 0x00U;

        /* Reset errorCode */
        husart->ErrorCode = HAL_USART_ERROR_NONE;

        /* Restore husart->State to Ready */
        husart->State  = HAL_USART_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Abort Complete Callback */
        husart->AbortCpltCallback(husart);
#else
        /* Call legacy weak Abort Complete Callback */
        HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }

    return HAL_OK;
}

/**
  * @brief  This function handles USART interrupt request.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
void HAL_USART_IRQHandler(USART_HandleTypeDef *husart)
{
    uint32_t isrflags = READ_REG(husart->Instance->SR);
    uint32_t cr1its   = READ_REG(husart->Instance->CR1);
    uint32_t cr3its   = READ_REG(husart->Instance->CR3);
    uint32_t errorflags = 0x00U;
    uint32_t dmarequest = 0x00U;

    /* If no error occurs */
    errorflags = (isrflags & (uint32_t)(USART_SR_PE | USART_SR_FE | USART_SR_ORE | USART_SR_NE));
    if (errorflags == RESET)
    {
        /* USART in mode Receiver -------------------------------------------------*/
        if (((isrflags & USART_SR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
        {
            if (husart->State == HAL_USART_STATE_BUSY_RX)
            {
                USART_Receive_IT(husart);
            }
            else
            {
                USART_TransmitReceive_IT(husart);
            }
            return;
        }
    }
    /* If some errors occur */
    if ((errorflags != RESET) && (((cr3its & USART_CR3_EIE) != RESET) || ((cr1its & (USART_CR1_RXNEIE | USART_CR1_PEIE)) != RESET)))
    {
        /* USART parity error interrupt occurred ----------------------------------*/
        if (((isrflags & USART_SR_PE) != RESET) && ((cr1its & USART_CR1_PEIE) != RESET))
        {
            husart->ErrorCode |= HAL_USART_ERROR_PE;
        }

        /* USART noise error interrupt occurred --------------------------------*/
        if (((isrflags & USART_SR_NE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            husart->ErrorCode |= HAL_USART_ERROR_NE;
        }

        /* USART frame error interrupt occurred --------------------------------*/
        if (((isrflags & USART_SR_FE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            husart->ErrorCode |= HAL_USART_ERROR_FE;
        }

        /* USART Over-Run interrupt occurred -----------------------------------*/
        if (((isrflags & USART_SR_ORE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            husart->ErrorCode |= HAL_USART_ERROR_ORE;
        }

        if (husart->ErrorCode != HAL_USART_ERROR_NONE)
        {
            /* USART in mode Receiver -----------------------------------------------*/
            if (((isrflags & USART_SR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
            {
                if (husart->State == HAL_USART_STATE_BUSY_RX)
                {
                    USART_Receive_IT(husart);
                }
                else
                {
                    USART_TransmitReceive_IT(husart);
                }
            }
            /* If Overrun error occurs, or if any error occurs in DMA mode reception,
            consider error as blocking */
            dmarequest = HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR);
            if (((husart->ErrorCode & HAL_USART_ERROR_ORE) != RESET) || dmarequest)
            {
                /* Set the USART state ready to be able to start again the process,
                Disable Rx Interrupts, and disable Rx DMA request, if ongoing */
                USART_EndRxTransfer(husart);

                /* Disable the USART DMA Rx request if enabled */
                if (HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR))
                {
                    CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);

                    /* Abort the USART DMA Rx channel */
                    if (husart->hdmarx != NULL)
                    {
                        /* Set the USART DMA Abort callback :
                        will lead to call HAL_USART_ErrorCallback() at end of DMA abort procedure */
                        husart->hdmarx->XferAbortCallback = USART_DMAAbortOnError;

                        if (HAL_DMA_Abort_IT(husart->hdmarx) != HAL_OK)
                        {
                            /* Call Directly XferAbortCallback function in case of error */
                            husart->hdmarx->XferAbortCallback(husart->hdmarx);
                        }
                    }
                    else
                    {
                        /* Call user error callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
                        /* Call registered Error Callback */
                        husart->ErrorCallback(husart);
#else
                        /* Call legacy weak Error Callback */
                        HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
                    }
                }
                else
                {
                    /* Call user error callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
                    /* Call registered Error Callback */
                    husart->ErrorCallback(husart);
#else
                    /* Call legacy weak Error Callback */
                    HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
                }
            }
            else
            {
                /* Call user error callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
                /* Call registered Error Callback */
                husart->ErrorCallback(husart);
#else
                /* Call legacy weak Error Callback */
                HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
                husart->ErrorCode = HAL_USART_ERROR_NONE;
            }
        }
        return;
    }

    /* USART in mode Transmitter -----------------------------------------------*/
    if (((isrflags & USART_SR_TXE) != RESET) && ((cr1its & USART_CR1_TXEIE) != RESET))
    {
        if (husart->State == HAL_USART_STATE_BUSY_TX)
        {
            USART_Transmit_IT(husart);
        }
        else
        {
            USART_TransmitReceive_IT(husart);
        }
        return;
    }

