sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
            /* Enable the USART Transmit Complete Interrupt */
            SET_BIT(husart->Instance->CR1, USART_CR1_TCIE);
        }
    }
    /* DMA Circular mode */
    else
    {
        if (husart->State == HAL_USART_STATE_BUSY_TX)
        {
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Complete Callback */
            husart->TxCpltCallback(husart);
#else
            /* Call legacy weak Tx Complete Callback */
            HAL_USART_TxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
    }
}

/**
  * @brief  DMA USART transmit process half complete callback
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMATxHalfCplt(DMA_HandleTypeDef *hdma)
{
    USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Tx Half Complete Callback */
    husart->TxHalfCpltCallback(husart);
#else
    /* Call legacy weak Tx Half Complete Callback */
    HAL_USART_TxHalfCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART receive process complete callback.
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
    USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
    /* DMA Normal mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) == 0U)
    {
        husart->RxXferCount = 0x00U;

        /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
        CLEAR_BIT(husart->Instance->CR1, USART_CR1_PEIE);
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

        /* Disable the DMA transfer for the Transmit/receiver request by clearing the DMAT/DMAR bit
             in the USART CR3 register */
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);
        CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

        husart->State = HAL_USART_STATE_READY;

        /* The USART state is HAL_USART_STATE_BUSY_RX */
        if (husart->State == HAL_USART_STATE_BUSY_RX)
        {
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Rx Complete Callback */
            husart->RxCpltCallback(husart);
#else
            /* Call legacy weak Rx Complete Callback */
            HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
        /* The USART state is HAL_USART_STATE_BUSY_TX_RX */
        else
        {
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Rx Complete Callback */
            husart->TxRxCpltCallback(husart);
#else
            /* Call legacy weak Tx Rx Complete Callback */
            HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
    }
    /* DMA circular mode */
    else
    {
        if (husart->State == HAL_USART_STATE_BUSY_RX)
        {
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Rx Complete Callback */
            husart->RxCpltCallback(husart);
#else
            /* Call legacy weak Rx Complete Callback */
            HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
        /* The USART state is HAL_USART_STATE_BUSY_TX_RX */
        else
        {
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Rx Complete Callback */
            husart->TxRxCpltCallback(husart);
#else
            /* Call legacy weak Tx Rx Complete Callback */
            HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
    }
}

/**
  * @brief  DMA USART receive process half complete callback
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMARxHalfCplt(DMA_HandleTypeDef *hdma)
{
    USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Rx Half Complete Callback */
    husart->RxHalfCpltCallback(husart);
#else
    /* Call legacy weak Rx Half Complete Callback */
    HAL_USART_RxHalfCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART communication error callback.
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMAError(DMA_HandleTypeDef *hdma)
{
    uint32_t dmarequest = 0x00U;
    USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
    husart->RxXferCount = 0x00U;
    husart->TxXferCount = 0x00U;

    /* Stop USART DMA Tx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAT);
    if ((husart->State == HAL_USART_STATE_BUSY_TX) && dmarequest)
    {
        USART_EndTxTransfer(husart);
    }

    /* Stop USART DMA Rx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(husart->Instance->CR3, USART_CR3_DMAR);
    if ((husart->State == HAL_USART_STATE_BUSY_RX) && dmarequest)
    {
        USART_EndRxTransfer(husart);
    }

    husart->ErrorCode |= HAL_USART_ERROR_DMA;
    husart->State = HAL_USART_STATE_READY;

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Error Callback */
    husart->ErrorCallback(husart);
#else
    /* Call legacy weak Error Callback */
    HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  This function handles USART Communication Timeout.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @param  Flag specifies the USART flag to check.
  * @param  Status The new Flag status (SET or RESET).
  * @param  Tickstart Tick start value.
  * @param  Timeout Timeout duration.
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_WaitOnFlagUntilTimeout(USART_HandleTypeDef *husart, uint32_t Flag, FlagStatus Status, uint32_t Tickstart, uint32_t Timeout)
{
    /* Wait until flag is set */
    while ((__HAL_USART_GET_FLAG(husart, Flag) ? SET : RESET) == Status)
    {
        /* Check for the Timeout */
        if (Timeout != HAL_MAX_DELAY)
        {
            if ((Timeout == 0U) || ((HAL_GetTick() - Tickstart) > Timeout))
            {
                /* Disable the USART Transmit Complete Interrupt */
                CLEAR_BIT(husart->Instance->CR1, USART_CR1_TXEIE);

                /* Disable the USART RXNE Interrupt */
                CLEAR_BIT(husart->Instance->CR1, USART_CR1_RXNEIE);

                /* Disable the USART Parity Error Interrupt */
                CLEAR_BIT(husart->Instance->CR1, USART_CR1_PEIE);

