sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_usart.c
            /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
            CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

            husart->State = HAL_USART_STATE_READY;

#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Rx Complete Callback */
            husart->TxRxCpltCallback(husart);
#else
            /* Call legacy weak Tx Rx Complete Callback */
            HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

            return HAL_OK;
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Configures the USART peripheral.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
static void USART_SetConfig(USART_HandleTypeDef *husart)
{
    uint32_t tmpreg = 0x00U;
    uint32_t pclk;

    /* Check the parameters */
    assert_param(IS_USART_INSTANCE(husart->Instance));
    assert_param(IS_USART_POLARITY(husart->Init.CLKPolarity));
    assert_param(IS_USART_PHASE(husart->Init.CLKPhase));
    assert_param(IS_USART_LASTBIT(husart->Init.CLKLastBit));
    assert_param(IS_USART_BAUDRATE(husart->Init.BaudRate));
    assert_param(IS_USART_WORD_LENGTH(husart->Init.WordLength));
    assert_param(IS_USART_STOPBITS(husart->Init.StopBits));
    assert_param(IS_USART_PARITY(husart->Init.Parity));
    assert_param(IS_USART_MODE(husart->Init.Mode));

    /* The LBCL, CPOL and CPHA bits have to be selected when both the transmitter and the
       receiver are disabled (TE=RE=0) to ensure that the clock pulses function correctly. */
    CLEAR_BIT(husart->Instance->CR1, (USART_CR1_TE | USART_CR1_RE));

    /*---------------------------- USART CR2 Configuration ---------------------*/
    tmpreg = husart->Instance->CR2;
    /* Clear CLKEN, CPOL, CPHA and LBCL bits */
    tmpreg &= (uint32_t)~((uint32_t)(USART_CR2_CPHA | USART_CR2_CPOL | USART_CR2_CLKEN | USART_CR2_LBCL | USART_CR2_STOP));
    /* Configure the USART Clock, CPOL, CPHA and LastBit -----------------------*/
    /* Set CPOL bit according to husart->Init.CLKPolarity value */
    /* Set CPHA bit according to husart->Init.CLKPhase value */
    /* Set LBCL bit according to husart->Init.CLKLastBit value */
    /* Set Stop Bits: Set STOP[13:12] bits according to husart->Init.StopBits value */
    tmpreg |= (uint32_t)(USART_CLOCK_ENABLE | husart->Init.CLKPolarity |
                         husart->Init.CLKPhase | husart->Init.CLKLastBit | husart->Init.StopBits);
    /* Write to USART CR2 */
    WRITE_REG(husart->Instance->CR2, (uint32_t)tmpreg);

    /*-------------------------- USART CR1 Configuration -----------------------*/
    tmpreg = husart->Instance->CR1;

    /* Clear M, PCE, PS, TE and RE bits */
    tmpreg &= (uint32_t)~((uint32_t)(USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE | USART_CR1_RE));

    /* Configure the USART Word Length, Parity and mode:
       Set the M bits according to husart->Init.WordLength value
       Set PCE and PS bits according to husart->Init.Parity value
       Set TE and RE bits according to husart->Init.Mode value
     */
    tmpreg |= (uint32_t)husart->Init.WordLength | husart->Init.Parity | husart->Init.Mode;

    /* Write to USART CR1 */
    WRITE_REG(husart->Instance->CR1, (uint32_t)tmpreg);

    /*-------------------------- USART CR3 Configuration -----------------------*/
    /* Clear CTSE and RTSE bits */
    CLEAR_BIT(husart->Instance->CR3, (USART_CR3_RTSE | USART_CR3_CTSE));

    /*-------------------------- USART BRR Configuration -----------------------*/
//  if((husart->Instance == USART1))
//  {
//    pclk = HAL_RCC_GetPCLK2Freq();
//    husart->Instance->BRR = USART_BRR(pclk, husart->Init.BaudRate);
//  }
//  else
//  {
    pclk = HAL_RCC_GetPCLK1Freq();
    husart->Instance->BRR = USART_BRR(pclk, husart->Init.BaudRate);
//  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_USART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya Semiconductor *****END OF FILE****/
